<a href='https://www.darshan.ac.in/'> <img src='https://www.darshan.ac.in/Content/media/DU_Logo.svg' width="250" height="300"/></a>
<pre>
<center><b><h1>Data Mining</b></center>
<center><b><h1>Lab - 1</b></center>  
<center><b><h3>23010101226 - Drashti Rathod - 516</h3></b></center>
<pre>

# Introduction to Pandas Library Function:

# Step-1 Import the pandas Libraries

In [ ]:
import pandas as pd

# Step-2 Import the dataset from this:....

In [ ]:
data = pd.read_csv("titanic.csv")

# Step-3 Read csv or excel File

In [ ]:
data = pd.read_csv("titanic.csv")

# Step-4 Print Data from csv or excel File

In [ ]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Step-5 See the First 10 Rows

In [ ]:
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

# Step-6 See the Last 10 Rows

In [ ]:
data.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Step-7 Data type of each columns

In [ ]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# Step-8 Display Summary Information

In [ ]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Step-9 Access a specific column

In [ ]:
#row,column
data.shape

(891, 12)

In [ ]:
#row index 0 and column index 1
data.shape[1]

12

In [ ]:
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

# Step-10 Access rows by their integer location

In [ ]:
data.iloc[6]  #row

PassengerId                          7
Survived                             0
Pclass                               1
Name           McCarthy, Mr. Timothy J
Sex                               male
Age                               54.0
SibSp                                0
Parch                                0
Ticket                           17463
Fare                           51.8625
Cabin                              E46
Embarked                             S
Name: 6, dtype: object

In [ ]:
data.iloc[100:200]   #just like slicing

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
100,101,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,NaN,S
101,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
103,104,0,3,"Johansson, Mr. Gustaf Joel",male,33.0,0,0,7540,8.6542,NaN,S
104,105,0,3,"Gustafsson, Mr. Anders Vilhelm",male,37.0,2,0,3101276,7.9250,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
196,197,0,3,"Mernagh, Mr. Robert",male,NaN,0,0,368703,7.7500,NaN,Q
197,198,0,3,"Olsen, Mr. Karl Siegwart Andreas",male,42.0,0,1,4579,8.4042,NaN,S
198,199,1,3,"Madigan, Miss. Margaret ""Maggie""",female,NaN,0,0,370370,7.7500,NaN,Q
199,200,0,2,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.0,0,0,248747,13.0000,NaN,S

# Step-11 Delete a specific Column

In [ ]:
data.drop('Age', axis = 1, inplace = True)

In [ ]:
data

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500,NaN,Q

# Step-12  Create a new Column

In [ ]:
#data['Amount'] = data['Fare']
#data['Amount'] = "Amt"
data['Amount'] = data['Fare'].apply(lambda x: "High" if x>10 else "Low")
data

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amount
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S,Low
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C,High
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S,Low
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S,High
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S,Low
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000,NaN,S,High
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000,B42,S,High
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500,NaN,S,High
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000,C148,C,High
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500,NaN,Q,Low

# Step-13  Perform Condition Selection on DataFrame

In [ ]:
#filteredrow = data[ (data['Fare']>20) & (data['Fare']>30) ]
data[data['Fare']>100]
#data.query('Fare >10 and Fare <20')

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amount
27,28,0,1,"Fortune, Mr. Charles Alexander",male,3,2,19950,263.0000,C23 C25 C27,S,High
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,1,0,PC 17569,146.5208,B78,C,High
88,89,1,1,"Fortune, Miss. Mabel Helen",female,3,2,19950,263.0000,C23 C25 C27,S,High
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,0,1,PC 17558,247.5208,B58 B60,C,High
195,196,1,1,"Lurette, Miss. Elise",female,0,0,PC 17569,146.5208,B80,C,High
215,216,1,1,"Newell, Miss. Madeleine",female,1,0,35273,113.2750,D36,C,High
258,259,1,1,"Ward, Miss. Anna",female,0,0,PC 17755,512.3292,NaN,C,High
268,269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,0,1,PC 17582,153.4625,C125,S,High
269,270,1,1,"Bissette, Miss. Amelia",female,0,0,PC 17760,135.6333,C99,S,High
297,298,0,1,"Allison, Miss. Helen Loraine",female,1,2,113781,151.5500,C22 C26,S,High
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,0,1,PC 17558,247.5208,B58 B60,C,High
305,306,1,1,"Allison, Master. Hudson Trevor",male,1,2,113781,151.5500,C22 C26,S,High
306,307,1,1,"Fleming, Miss. Margaret",female,0,0,17421,110.8833,NaN,C,High
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,1,0,PC 17758,108.9000,C65,C,High
311,312,1,1,"Ryerson, Miss. Emily Borie",female,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,High
318,319,1,1,"Wick, Miss. Mary Natalie",female,0,2,36928,164.8667,C7,S,High
319,320,1,1,"Spedden, Mrs. Frederic Oakley (Margaretta Corn...",female,1,1,16966,134.5000,E34,C,High
325,326,1,1,"Young, Miss. Marie Grice",female,0,0,PC 17760,135.6333,C32,C,High
332,333,0,1,"Graham, Mr. George Edward",male,0,1,PC 17582,153.4625,C91,S,High
334,335,1,1,"Frauenthal, Mrs. Henry William (Clara Heinshei...",female,1,0,PC 17611,133.6500,NaN,S,High
337,338,1,1,"Burns, Miss. Elizabeth Margaret",female,0,0,16966,134.5000,E40,C,High
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,3,2,19950,263.0000,C23 C25 C27,S,High
373,374,0,1,"Ringhini, Mr. Sante",male,0,0,PC 17760,135.6333,NaN,C,High
377,378,0,1,"Widener, Mr. Harry Elkins",male,0,2,113503,211.5000,C82,C,High
380,381,1,1,"Bidois, Miss. Rosalie",female,0,0,PC 17757,227.5250,NaN,C,High
390,391,1,1,"Carter, Mr. William Ernest",male,1,2,113760,120.0000,B96 B98,S,High
393,394,1,1,"Newell, Miss. Marjorie",female,1,0,35273,113.2750,D36,C,High
435,436,1,1,"Carter, Miss. Lucile Polk",female,1,2,113760,120.0000,B96 B98,S,High
438,439,0,1,"Fortune, Mr. Mark",male,1,4,19950,263.0000,C23 C25 C27,S,High
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,1,2,113781,151.5500,C22 C26,S,High
505,506,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,1,0,PC 17758,108.9000,C65,C,High
527,528,0,1,"Farthing, Mr. John",male,0,0,PC 17483,221.7792,C95,S,High
537,538,1,1,"LeRoy, Miss. Bertha",female,0,0,PC 17761,106.4250,NaN,C,High
544,545,0,1,"Douglas, Mr. Walter Donald",male,1,0,PC 17761,106.4250,C86,C,High
550,551,1,1,"Thayer, Mr. John Borland Jr",male,0,2,17421,110.8833,C70,C,High
557,558,0,1,"Robbins, Mr. Victor",male,0,0,PC 17757,227.5250,NaN,C,High
581,582,1,1,"Thayer, Mrs. John Borland (Marian Longstreth M...",female,1,1,17421,110.8833,C68,C,High
609,610,1,1,"Shutes, Miss. Elizabeth W",female,0,0,PC 17582,153.4625,C125,S,High
659,660,0,1,"Newell, Mr. Arthur Webster",male,0,2,35273,113.2750,D48,C,High
660,661,1,1,"Frauenthal, Dr. Henry William",male,2,0,PC 17611,133.6500,NaN,S,High
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,0,1,PC 17755,512.3292,B51 B53 B55,C,High
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,0,1,24160,211.3375,B5,S,High
698,699,0,1,"Thayer, Mr. John Borland",male,1,1,17421,110.8833,C68,C,High
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,1,0,PC 17757,227.5250,C62 C64,C,High
708,709,1,1,"Cleaver, Miss. Alice",female,0,0,113781,151.5500,NaN,S,High
716,717,1,1,"Endres, Miss. Caroline Louise",female,0,0,PC 17757,227.5250,C45,C,High
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,0,0,24160,211.3375,B5,S,High
737,738,1,1,"Lesurer, Mr. Gustave J",male,0,0,PC 17755,512.3292,B101,C,High
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,High
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,1,2,113760,120.0000,B96 B98,S,High
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,0,1,24160,211.3375,B3,S,High
802,803,1,1,"Carter, Master. William Thornton II",male,1,2,113760,120.0000,B96 B98,S,High
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,1,1,36928,164.8667,NaN,S,High

# Step-14 Compute the sum of value

In [ ]:
data['Fare'].sum()

28693.9493

# Step-15 Compute the mean of value

In [ ]:
data['Fare'].mean()

32.204207968574636

# Step-16 Count non-null value (column)

In [ ]:
data.count()  #count of not null values

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
Amount         891
dtype: int64

In [ ]:
data.isnull().sum() #count of null values

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Amount           0
dtype: int64

In [ ]:
(~data.isnull()).sum() #count of not null using gate

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
Amount         891
dtype: int64

# Step-17 Find Minimun or Maximum values

In [ ]:
data['Fare'].min()

0.0

In [ ]:
data['Fare'].max()

512.3292